# DirectShapeOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeOptions Class
Members See Also
---
This class is used to control behavior of a DirectShape object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class DirectShapeOptions : IDisposable
```

Visual Basic
---
```text
Public Class DirectShapeOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DirectShapeOptions : IDisposable
```

# Remarks
Use Enable/Disable functions to change the default behavior. Use DirectShape.SetOptions to modify that object's behavior.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DirectShapeOptions
# See Also
DirectShapeOptions Members
Autodesk.Revit.DB Namespace